---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.DistanceBetweenBarsError
source: html/3874401a-e754-c985-7c7d-0c48c3106257.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.DistanceBetweenBarsError Property

This is used to post error. The distance between the connected ends of the bars exceeds 10 bar diameters.

## Syntax (C#)
```csharp
public static FailureDefinitionId DistanceBetweenBarsError { get; }
```